# AnalyticalModelPerimeter Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AnalyticalModelPerimeter Property
ParameterTypeId Class See Also
---
"Perimeter": The Perimeter of Analytical Model
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AnalyticalModelPerimeter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AnalyticalModelPerimeter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AnalyticalModelPerimeter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace